
-- 関数の場合 fmap = (.)
r1 = ((+1) <$> (*2) <$> (*3)) 1
r2 = ((+1) <$> (*2) <$>) Just 1
r3 = ((+1) .(*2)) <$> Just 1
r4 = (+1) <$> (*2) <$> (+9) <$> (Just 1)
r5 = ((+1) . (*2) . (+9)) <$> (Just 1)



-- モナドな値を普通の関数の引数にはできない。
-- そういうときは、functorを利用する

-- 関数の適用
r1 = (2+) 3  -- 5

-- ラッパに入った値に対しては関数は適用できない
-- r2 = (2+) (Just 3)

-- fmap:: (a -> b) -> f a -> f b (このfがモナドつまりラッパ)
r3 = fmap (2+) (Just 3)

-- <$ = fmap . const
c1 = 1 <$ (Just "abc")  -- Just 1
c2 =  (fmap . const) 1 (Just "abc")  -- Just 1

-- >> = (. const) . (>>=)
b1 = ((. const) . (>>=)) (Just 1) (Just 2)  -- Just 2
