;; -r, 読み込み可能
;; -w, 書き込み可能
;; -x, 実行可能で
;; -o, 実行者とファイルの所有者が同一
;; -R, 実uid/gidで読み込み可能
;; -W, 実uid/gidで書き込み可能
;; -X, 実uid/gidで実行可能
;; -O, 実uidとファイルの所有者が同一
;; -e, ファイルが存在する
;; -z, ファイルサイズが 0
;; -s, ファイルサイズが 0 以外（大きさを返す）
;; -f, ファイルは通常ファイル
;; -d, ファイルはディレクトリ
;; -l, ファイルはシンボリックリンク
;; -p, ファイルは名前付きパイプ
;; -S, ファイルはソケット
;; -b, ファイルはブロック型の特殊ファイル
;; -c, ファイルはキャラクタ型の特殊ファイル
;; -t, ファイルハンドルが tty としてオープンされている
;; -u, ファイルの setuid ビットがセットされている
;; -g, ファイルの setgif ビットがセットされている
;; -k, ファイルの sticky ビットがセットされている
;; -T, ファイルがテキストファイル
;; -B, ファイルがバイナリファイル
;; -M, perl起動時における、ファイルの更新時刻からの日数
;; -A, perl起動時における、ファイルの参照時刻からの日数
;; -C, perl起動時における、ファイルの作成時刻からの日数
